[
  {
    "id": "Customer Job",
    "content": "Generates high quality synthetic data for LLM pre-training from marketing content like landing pages, blogsposts, user reviews, and news",
    "edge": [
      {
        "target_id": "Process for Quality Validation",
        "relationship": "has process",
        "rationale": "The company's claim of 'high quality' implies an internal process to validate its own product. Weave's feedback and evaluation tools are directly applicable to building and running this validation process."
      }
    ]
  },
  {
    "id": "Process for Quality Validation",
    "content": "Validates synthetic data quality by evaluating the performance of models trained on it",
    "edge": [
      {
        "target_id": "Human-in-the-Loop Workflow",
        "relationship": "relies on",
        "rationale": "For nuanced LLM tasks, automated metrics are often insufficient. A robust validation process requires qualitative human judgment, highlighting a direct need for Weave’s UI-based feedback system."
      }
    ]
  },
  {
    "id": "Human-in-the-Loop Workflow",
    "content": "Requires a human-in-the-loop workflow for qualitative assessment of model outputs",
    "edge": [
      {
        "target_id": "Annotation Guideline Management",
        "relationship": "necessitates",
        "rationale": "A human-in-the-loop workflow is only effective if the feedback is consistent. This establishes the need for a formal system of instructions (a rubric) for the human reviewers, which points to a need for Weave's 'structured data' feedback type."
      }
    ]
  },
  {
    "id": "Annotation Guideline Management",
    "content": "Defines and manages annotation guidelines and rubrics for reviewers",
    "edge": [
      {
        "target_id": "Product Feature (Weave Feedback System)",
        "relationship": "is solved by",
        "rationale": "The need to collect, manage, and structure human annotations and feedback is a direct use case for a dedicated product feature."
      }
    ]
  },
  {
    "id": "Product Feature (Weave Feedback System)",
    "content": "Efficiently evaluating LLM applications requires robust tooling to collect and analyze feedback. W&B Weave provides an integrated feedback system, allowing users to provide call feedback directly through the UI or programmatically via the SDK.",
    "edge": [
      {
        "target_id": "Product",
        "relationship": "is a feature of",
        "rationale": "This specific feedback system is a core component of the overall product offering."
      }
    ]
  }
]
